"""
6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.

Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
"""

from itertools import count, cycle, combinations

# -----A-----
for i in count(10):
    if i > 50:
        break
    else:
        (print(i))


# -----B-----
cnt = 0
for i in cycle(combinations(('Red', 'Yellow', 'Green'), 2)):
    print(*i)
    cnt += 1
    if cnt >= 10:
        break


